***Data Collection : DB & REST API ***
 

*    Input   - Read data from MySQL 
                - Read data form REST API by Package Request

*    Output - All Dataset to

**Get Data form MYSQL Database**

In [ ]:
! pip install pymysql; echo 'hi'      ## Install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.7/dist-packages (1.0.2)
hi

In [ ]:
class Config:
  MYSQL_HOST = 'db4free.net'
  MYSQL_PORT = 3306  #default port MYSQL
  MYSQL_USER = gongjun[0].strip()
  MYSQL_PASSWORD = gongjun[1].strip()
  MYSQL_DB = "de_ayp"
  MYSQL_CHARSET = 'utf8mb4'      ##Config DB Credential

In [ ]:
import pymysql.cursors

connection = pymysql.connect(host=Config.MYSQL_HOST,
                             port=Config.MYSQL_PORT,
                             user=Config.MYSQL_USER,
                             password=Config.MYSQL_PASSWORD,
                             db=Config.MYSQL_DB,
                             charset=Config.MYSQL_CHARSET,
                             cursorclass=pymysql.cursors.DictCursor)  ##Connect to DB

In [ ]:
connection

In [ ]:
cursor = connection.cursor()
cursor.execute("show tables;")
tables = cursor.fetchall()
cursor.close()
print(tables)  ##list all tables

[{'Tables_in_de_ayp': 'online_retail'}, {'Tables_in_de_ayp': 'scores'}, {'Tables_in_de_ayp': 'students'}]

**Query Table**

In [ ]:
# used 'with statement' replace 'cursor.close()'
#  Query all data from table online_retail 

with connection.cursor() as cursor:
  # Read a single record
  sql = "SELECT * FROM online_retail;"
  cursor.execute(sql)
  result = cursor.fetchall()

print("number of rows: ", len(result))

number of rows:  161331

In [ ]:
type (result)

list

**Convert to Pandas**

In [ ]:
import pandas as pd

In [ ]:
retail = pd.DataFrame(result)

In [ ]:
type(retail)

pandas.core.frame.DataFrame

In [ ]:
retail

        InvoiceNo StockCode  ... CustomerID         Country
0          536365    85123A  ...    17850.0  United Kingdom
1          536365     71053  ...    17850.0  United Kingdom
2          536365    84406B  ...    17850.0  United Kingdom
3          536365    84029G  ...    17850.0  United Kingdom
4          536365    84029E  ...    17850.0  United Kingdom
...           ...       ...  ...        ...             ...
161326     550638     22960  ...        NaN  United Kingdom
161327     550638     22961  ...        NaN  United Kingdom
161328     550638     22978  ...        NaN  United Kingdom
161329     550638     22982  ...        NaN  United Kingdom
161330     550638     23193  ...        NaN  United Kingdom

[161331 rows x 8 columns]

**Get data from REST API**

In [ ]:
##Offline dont forgot Install: pip install requests 
##But Colab pre-install already

In [ ]:
import requests

In [ ]:
url = "https://de-training-2020-7au6fmnprq-de.a.run.app/currency_gbp/all"

response = requests.get(url)
response.text

In [ ]:
response.json()

In [ ]:
type(response.text)

str

**JSON loading**

In [ ]:
## JSON show str, so convert str to dictionary
## By import json (built-in package)

In [ ]:
import json

In [ ]:
? json   ##help for found package

In [ ]:
result = response.json()
result

In [ ]:
result_conversion_rate = json.loads(response.text)
result_conversion_rate

In [ ]:
print(type(result_conversion_rate))
assert isinstance(result_conversion_rate, dict)

<class 'dict'>

**Convert to pandas**

In [ ]:
conversion_rate = pd.DataFrame.from_dict(result_conversion_rate)

In [ ]:
conversion_rate[:5]

                             Rate
2018-01-01T00:00:00.000Z  43.9991
2018-01-02T00:00:00.000Z  44.0731
2018-01-03T00:00:00.000Z  43.7025
2018-01-04T00:00:00.000Z  43.6914
2018-01-05T00:00:00.000Z  43.6490

In [ ]:
conversion_rate = conversion_rate.reset_index().rename(columns={"index":"date"})
conversion_rate[:5]  ##Change index name to date

                       date     Rate
0  2018-01-01T00:00:00.000Z  43.9991
1  2018-01-02T00:00:00.000Z  44.0731
2  2018-01-03T00:00:00.000Z  43.7025
3  2018-01-04T00:00:00.000Z  43.6914
4  2018-01-05T00:00:00.000Z  43.6490

In [ ]:
conversion_rate[:5]

                       date     Rate
0  2018-01-01T00:00:00.000Z  43.9991
1  2018-01-02T00:00:00.000Z  44.0731
2  2018-01-03T00:00:00.000Z  43.7025
3  2018-01-04T00:00:00.000Z  43.6914
4  2018-01-05T00:00:00.000Z  43.6490

**Join the data**

In [ ]:
retail

        InvoiceNo StockCode  ... CustomerID         Country
0          536365    85123A  ...    17850.0  United Kingdom
1          536365     71053  ...    17850.0  United Kingdom
2          536365    84406B  ...    17850.0  United Kingdom
3          536365    84029G  ...    17850.0  United Kingdom
4          536365    84029E  ...    17850.0  United Kingdom
...           ...       ...  ...        ...             ...
161326     550638     22960  ...        NaN  United Kingdom
161327     550638     22961  ...        NaN  United Kingdom
161328     550638     22978  ...        NaN  United Kingdom
161329     550638     22982  ...        NaN  United Kingdom
161330     550638     23193  ...        NaN  United Kingdom

[161331 rows x 8 columns]

In [ ]:
## keep a copy column InvoiceDate for the future used (timestamp Loss)
retail['InvoiceTimestamp'] = retail['InvoiceDate']
retail

        InvoiceNo StockCode  ...         Country  InvoiceTimestamp
0          536365    85123A  ...  United Kingdom   1/12/2018 08:26
1          536365     71053  ...  United Kingdom   1/12/2018 08:26
2          536365    84406B  ...  United Kingdom   1/12/2018 08:26
3          536365    84029G  ...  United Kingdom   1/12/2018 08:26
4          536365    84029E  ...  United Kingdom   1/12/2018 08:26
...           ...       ...  ...             ...               ...
161326     550638     22960  ...  United Kingdom   19/4/2019 15:44
161327     550638     22961  ...  United Kingdom   19/4/2019 15:44
161328     550638     22978  ...  United Kingdom   19/4/2019 15:44
161329     550638     22982  ...  United Kingdom   19/4/2019 15:44
161330     550638     23193  ...  United Kingdom   19/4/2019 15:44

[161331 rows x 9 columns]

In [ ]:
## Convert InvoiceDate to retail and date in conversion_rate only apart of date  

retail['InvoiceDate'] = pd.to_datetime(retail['InvoiceDate']).dt.date
conversion_rate['date'] = pd.to_datetime(conversion_rate['date']).dt.date

retail.head()

   InvoiceNo StockCode  ...         Country  InvoiceTimestamp
0     536365    85123A  ...  United Kingdom   1/12/2018 08:26
1     536365     71053  ...  United Kingdom   1/12/2018 08:26
2     536365    84406B  ...  United Kingdom   1/12/2018 08:26
3     536365    84029G  ...  United Kingdom   1/12/2018 08:26
4     536365    84029E  ...  United Kingdom   1/12/2018 08:26

[5 rows x 9 columns]

In [ ]:
# include 2 dataframe together by merge command

final_df = retail.merge(conversion_rate, how="left", left_on="InvoiceDate", right_on="date")
final_df

        InvoiceNo StockCode  ...        date     Rate
0          536365    85123A  ...  2018-01-12  43.7705
1          536365     71053  ...  2018-01-12  43.7705
2          536365    84406B  ...  2018-01-12  43.7705
3          536365    84029G  ...  2018-01-12  43.7705
4          536365    84029E  ...  2018-01-12  43.7705
...           ...       ...  ...         ...      ...
161326     550638     22960  ...  2019-04-19  41.3622
161327     550638     22961  ...  2019-04-19  41.3622
161328     550638     22978  ...  2019-04-19  41.3622
161329     550638     22982  ...  2019-04-19  41.3622
161330     550638     23193  ...  2019-04-19  41.3622

[161331 rows x 11 columns]

**currency conversion**  (UnitPrice * Rate)

In [ ]:
final_df["THBPrice"] = final_df["UnitPrice"] * final_df["Rate"]  ## first method
final_df

        InvoiceNo StockCode  ...     Rate    THBPrice
0          536365    85123A  ...  43.7705  111.614775
1          536365     71053  ...  43.7705  148.381995
2          536365    84406B  ...  43.7705  120.368875
3          536365    84029G  ...  43.7705  148.381995
4          536365    84029E  ...  43.7705  148.381995
...           ...       ...  ...      ...         ...
161326     550638     22960  ...  41.3622  342.892638
161327     550638     22961  ...  41.3622   59.975190
161328     550638     22978  ...  41.3622  308.562012
161329     550638     22982  ...  41.3622  101.751012
161330     550638     23193  ...  41.3622  189.438876

[161331 rows x 12 columns]

In [ ]:
final_df["THBPrice"] = final_df.apply(lambda x: x["UnitPrice"] * x["Rate"], axis=1)  ## second method
final_df

        InvoiceNo StockCode  ...     Rate    THBPrice
0          536365    85123A  ...  43.7705  111.614775
1          536365     71053  ...  43.7705  148.381995
2          536365    84406B  ...  43.7705  120.368875
3          536365    84029G  ...  43.7705  148.381995
4          536365    84029E  ...  43.7705  148.381995
...           ...       ...  ...      ...         ...
161326     550638     22960  ...  41.3622  342.892638
161327     550638     22961  ...  41.3622   59.975190
161328     550638     22978  ...  41.3622  308.562012
161329     550638     22982  ...  41.3622  101.751012
161330     550638     23193  ...  41.3622  189.438876

[161331 rows x 12 columns]

In [ ]:
## third method

def convert_rate (price, rate) :
  return price * rate

final_df["THBPrice"] = final_df.apply(lambda x: convert_rate (x["UnitPrice"] , x["Rate"]), axis=1)
final_df

        InvoiceNo StockCode  ...     Rate    THBPrice
0          536365    85123A  ...  43.7705  111.614775
1          536365     71053  ...  43.7705  148.381995
2          536365    84406B  ...  43.7705  120.368875
3          536365    84029G  ...  43.7705  148.381995
4          536365    84029E  ...  43.7705  148.381995
...           ...       ...  ...      ...         ...
161326     550638     22960  ...  41.3622  342.892638
161327     550638     22961  ...  41.3622   59.975190
161328     550638     22978  ...  41.3622  308.562012
161329     550638     22982  ...  41.3622  101.751012
161330     550638     23193  ...  41.3622  189.438876

[161331 rows x 12 columns]

**Save to CSV**

In [ ]:
final_df.to_csv ("output.csv" , index=False)

In [ ]:
print ("End")

End